In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
data = pd.read_excel('titanic3.xls')

In [4]:
data20 = data['age'] < 20

In [5]:
data20

0       False
1        True
2        True
3       False
4       False
        ...
1304     True
1305    False
1306    False
1307    False
1308    False
Name: age, Length: 1309, dtype: bool

In [6]:
data30 =(data['age'] > 20) & (data['age'] < 30)

In [7]:
data30

0        True
1       False
2       False
3       False
4        True
        ...
1304    False
1305    False
1306     True
1307     True
1308     True
Name: age, Length: 1309, dtype: bool

In [8]:
data40 =(data['age'] > 30) & (data['age'] < 40)

In [9]:
data40

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: age, Length: 1309, dtype: bool

In [10]:
dataPlus40 =data['age'] > 40

In [11]:
dataPlus40

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: age, Length: 1309, dtype: bool

In [12]:
# En procédant comme cela nous avons 4 data set différents -> il aurait fallu utilisé la fonction loc pour faire du booléen indexing
dataBis = data.drop(['name', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], axis=1)
data = data.drop(['name', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], axis=1)
data.head()

   pclass  survived     sex      age
0       1         1  female  29.0000
1       1         1    male   0.9167
2       1         0  female   2.0000
3       1         0    male  30.0000
4       1         0  female  25.0000

In [13]:
data.loc[data['age'] <= 20, 'age'] = 0
data.loc[(data['age'] > 20) & (data['age'] <= 30), 'age'] = 1
data.loc[(data['age'] > 30) & (data['age'] <= 40), 'age'] = 2
data.loc[data['age'] > 40, 'age'] = 3

In [14]:
data.head()

   pclass  survived     sex  age
0       1         1  female  1.0
1       1         1    male  0.0
2       1         0  female  0.0
3       1         0    male  1.0
4       1         0  female  1.0

In [15]:
data['age'].value_counts()

1.0    361
0.0    248
3.0    227
2.0    210
Name: age, dtype: int64

In [16]:
data.groupby(['age']).mean()

       pclass  survived
age
0.0  2.568548  0.459677
1.0  2.371191  0.371191
2.0  2.109524  0.423810
3.0  1.643172  0.396476

In [24]:
# Autre façon de répondre en utilisant map qui est très puissant avec pandas
# cette fct permet d'appliquer une autre fct sur chaque élément d'une colonne
# La fct apply est un peu comme map() mais étendu à tout le dataframe

In [25]:
# il faut définir une fonction catégorie age

In [26]:
def category_age(age):
    if age <= 20:
        return '<20 ans'
    elif (age > 20) & (age <=30):
        return '20-30 ans'
    elif (age > 30) & (age <= 40):
        return '30-40 ans'
    else:
        return '+40 ans'

In [27]:
dataBis['age'].map(category_age)

0       20-30 ans
1         <20 ans
2         <20 ans
3       20-30 ans
4       20-30 ans
          ...
1304      <20 ans
1305      +40 ans
1306    20-30 ans
1307    20-30 ans
1308    20-30 ans
Name: age, Length: 1309, dtype: object

In [30]:
# Complément d'info
# Comment transformer des catégories en données numérique
# exemple colonne genre avec écrit male ou femell -> difficile de faire des math -> changer ça -> plusieurs façon

In [31]:
# map()
# replace()
# cat.codes

In [33]:
# avec map()
data['sex'].map({'male':0, 'female':1})

0       1
1       0
2       1
3       0
4       1
       ..
1304    1
1305    1
1306    0
1307    0
1308    0
Name: sex, Length: 1309, dtype: int64

In [34]:
# avec replace()
data['sex'].replace(['male', 'female'], [0, 1])

0       1
1       0
2       1
3       0
4       1
       ..
1304    1
1305    1
1306    0
1307    0
1308    0
Name: sex, Length: 1309, dtype: int64

In [35]:
# code de catégories
# cat_code
data['sex']

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: object

In [36]:
# Pour le moment les valeurs sont de type objet -> voir cidessus fin de tableau dtype: object
# dans pandas -> existe type catégorie -> pandas va compter le nombre de fois que les catégories apparaissent
data['sex'].astype('category')

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: category
Categories (2, object): ['female', 'male']

In [37]:
# et va les considérer en tant que tel dans notre colonne
# quand on a les catégories il suffit d'utiliser cat.codes
data['sex'].astype('category').cat.codes

0       0
1       1
2       0
3       1
4       0
       ..
1304    0
1305    0
1306    1
1307    1
1308    1
Length: 1309, dtype: int8

In [ ]:
# La ou cette technique est plus intéressante que les autres c'est quand on a bcp de type de catégories